In [4]:
import numpy as np
import pandas as pd

In [5]:
data = {
    "name": ["Rohit", "Aman", "Priya", "Neha", "Karan"],
    "age": [22, 23, 21, 24, 22],
    "city": ["Delhi", "Mumbai", "Pune", "Chennai", "Kolkata"],
    "marks": [85, 78, 92, 88, 76],
    "placed": [True, False, True, True, False]
}

In [9]:
df = pd.DataFrame(data)

In [10]:
df

    name  age     city  marks  placed
0  Rohit   22    Delhi     85    True
1   Aman   23   Mumbai     78   False
2  Priya   21     Pune     92    True
3   Neha   24  Chennai     88    True
4  Karan   22  Kolkata     76   False

In [45]:
data_list = [
    ["Rohit", 22, "Delhi", 85],
    ["Aman", 23, "Mumbai", 78],
    ["Priya", 21, "Pune", 92],
    ["Neha", 24, "Chennai", 88],
    ["Karan", 22, "Kolkata", 76]
]

In [46]:
columns_name = ["Name", "Age", "City", "Marks"]
df2 = pd.DataFrame(data_list, columns=columns_name)

In [47]:
df2

    Name  Age     City  Marks
0  Rohit   22    Delhi     85
1   Aman   23   Mumbai     78
2  Priya   21     Pune     92
3   Neha   24  Chennai     88
4  Karan   22  Kolkata     76

In [13]:
df2[["Name", "City"]]

    Name     City
0  Rohit    Delhi
1   Aman   Mumbai
2  Priya     Pune
3   Neha  Chennai
4  Karan  Kolkata

In [48]:
df2["Salary"] = [25000, 30000, 40000, 50000, 20000]

In [49]:
df2

    Name  Age     City  Marks  Salary
0  Rohit   22    Delhi     85   25000
1   Aman   23   Mumbai     78   30000
2  Priya   21     Pune     92   40000
3   Neha   24  Chennai     88   50000
4  Karan   22  Kolkata     76   20000

In [29]:
# df2.drop("Salary", axis=1, inplace = True)

In [44]:
df2

    Name  Age    City  Marks  Salary
0  Rohit   22   Delhi     85   25000
1   Aman   23  Mumbai     78   30000

In [33]:
df2.drop(0, axis=0)

    Name  Age     City  Marks  Salary
1   Aman   23   Mumbai     78   30000
2  Priya   21     Pune     92   40000
3   Neha   24  Chennai     88   50000
4  Karan   22  Kolkata     76   20000

In [34]:
df2["Name"]

0    Rohit
1     Aman
2    Priya
3     Neha
4    Karan
Name: Name, dtype: str

In [37]:
df2.loc[[0, 1]]

    Name  Age    City  Marks  Salary
0  Rohit   22   Delhi     85   25000
1   Aman   23  Mumbai     78   30000

In [39]:
df2.iloc[3]

Name         Neha
Age            24
City      Chennai
Marks          88
Salary      50000
Name: 3, dtype: object

In [43]:
df2 = df2.loc[[0, 1]]
df2[["Marks", "Salary"]]

   Marks  Salary
0     85   25000
1     78   30000

In [50]:
df2.loc[[0, 1]][["City", "Salary"]]

     City  Salary
0   Delhi   25000
1  Mumbai   30000

In [51]:
df2

    Name  Age     City  Marks  Salary
0  Rohit   22    Delhi     85   25000
1   Aman   23   Mumbai     78   30000
2  Priya   21     Pune     92   40000
3   Neha   24  Chennai     88   50000
4  Karan   22  Kolkata     76   20000

In [64]:
df2[(df2["Age"] >= 22) & (df2["City"] == "Kolkata")]

    Name  Age     City  Marks  Salary
4  Karan   22  Kolkata     76   20000